; domain
(define (domain pacman-63)
   (:requirements :strips :typing)
   (:types node)
   
   (:predicates
      (has_food ?location - node)
      (no_food ?location - node)
      (is_safe ?location - node)               ; complement of is_opponent_ghost
      (is_visited ?location)
      (at ?location - node)
      (not_at ?location - node)
      (connected ?n1 ?n2 - node)
   )

   (:action move_pacman
      :parameters (?start ?end - node)
      :precondition (and
         (at ?start)
         (not_at ?end)
         (no_food ?end)
         (connected ?start ?end)
         (is_safe ?end)
      )
      :effect (and
         (at ?end)
         (not_at ?start)
         (is_visited ?end)
      )
   )

   (:action eat_food
      :parameters (?start ?end - node)
      :precondition (and
         (at ?start)
         (has_food ?end)
         (connected ?start ?end)
         (is_safe ?end)
      )
      :effect (and
         (at ?end)
         (not_at ?start)
         (no_food ?end)
         (is_visited ?end)
      )
   )
)

; problem
(define (problem pacman-63)
    (:domain pacman-63)
    (:objects
        n0_0 n0_1 n0_2 n0_3 n0_4 n1_0 n1_1 n1_2 n1_3 n1_4 n2_0 n2_1 n2_2 n2_3 n2_4 n3_0 n3_1 n3_2 n3_3 n3_4 n4_0 n4_1 n4_2 n4_3 n4_4 - node
    )

    (:init
        (not_at n0_0)
        (not_at n0_1)
        (not_at n0_2)
        (not_at n0_3)
        (not_at n0_4)
        (not_at n1_0)
        (not_at n1_1)
        (not_at n1_2)
        (not_at n1_3)
        (not_at n1_4)
        (not_at n2_0)
        (not_at n2_1)
        (not_at n2_2)
        (not_at n2_3)
        (not_at n2_4)
        (not_at n3_0)
        (not_at n3_1)
        (not_at n3_2)
        (not_at n3_3)
        (not_at n3_4)
        (not_at n4_0)
        (at n4_1)
        (not_at n4_2)
        (not_at n4_3)
        (not_at n4_4)
        (no_food n0_0)
        (no_food n0_1)
        (no_food n0_2)
        (no_food n0_3)
        (no_food n0_4)
        (no_food n1_0)
        (no_food n1_1)
        (has_food n1_2)
        (no_food n1_3)
        (no_food n1_4)
        (no_food n2_0)
        (no_food n2_1)
        (no_food n2_2)
        (no_food n2_3)
        (no_food n2_4)
        (no_food n3_0)
        (no_food n3_1)
        (no_food n3_2)
        (no_food n3_3)
        (no_food n3_4)
        (has_food n4_0)
        (has_food n4_1)
        (no_food n4_2)
        (no_food n4_3)
        (no_food n4_4)
        (is_safe n0_0)
        (is_safe n0_1)
        (is_safe n0_2)
        (is_safe n0_3)
        (is_safe n0_4)
        (is_safe n1_1)
        (is_safe n1_2)
        (is_safe n1_3)
        (is_safe n1_4)
        (is_safe n2_1)
        (is_safe n2_2)
        (is_safe n2_3)
        (is_safe n2_4)
        (is_safe n3_0)
        (is_safe n3_1)
        (is_safe n3_3)
        (is_safe n3_4)
        (is_safe n4_0)
        (is_safe n4_1)
        (is_safe n4_2)
        (is_safe n4_4)
        (connected n0_0 n1_0)
        (connected n1_0 n0_0)
        (connected n0_0 n0_1)
        (connected n0_1 n0_0)
        (connected n0_1 n1_1)
        (connected n1_1 n0_1)
        (connected n0_1 n0_2)
        (connected n0_2 n0_1)
        (connected n0_2 n1_2)
        (connected n1_2 n0_2)
        (connected n0_2 n0_3)
        (connected n0_3 n0_2)
        (connected n0_3 n1_3)
        (connected n1_3 n0_3)
        (connected n0_3 n0_4)
        (connected n0_4 n0_3)
        (connected n0_4 n1_4)
        (connected n1_4 n0_4)
        (connected n1_0 n2_0)
        (connected n2_0 n1_0)
        (connected n1_0 n1_1)
        (connected n1_1 n1_0)
        (connected n1_1 n2_1)
        (connected n2_1 n1_1)
        (connected n1_1 n1_2)
        (connected n1_2 n1_1)
        (connected n1_2 n2_2)
        (connected n2_2 n1_2)
        (connected n1_2 n1_3)
        (connected n1_3 n1_2)
        (connected n1_3 n2_3)
        (connected n2_3 n1_3)
        (connected n1_3 n1_4)
        (connected n1_4 n1_3)
        (connected n1_4 n2_4)
        (connected n2_4 n1_4)
        (connected n2_0 n3_0)
        (connected n3_0 n2_0)
        (connected n2_0 n2_1)
        (connected n2_1 n2_0)
        (connected n2_1 n3_1)
        (connected n3_1 n2_1)
        (connected n2_1 n2_2)
        (connected n2_2 n2_1)
        (connected n2_2 n3_2)
        (connected n3_2 n2_2)
        (connected n2_2 n2_3)
        (connected n2_3 n2_2)
        (connected n2_3 n3_3)
        (connected n3_3 n2_3)
        (connected n2_3 n2_4)
        (connected n2_4 n2_3)
        (connected n2_4 n3_4)
        (connected n3_4 n2_4)
        (connected n3_0 n4_0)
        (connected n4_0 n3_0)
        (connected n3_0 n3_1)
        (connected n3_1 n3_0)
        (connected n3_1 n4_1)
        (connected n4_1 n3_1)
        (connected n3_1 n3_2)
        (connected n3_2 n3_1)
        (connected n3_2 n4_2)
        (connected n4_2 n3_2)
        (connected n3_2 n3_3)
        (connected n3_3 n3_2)
        (connected n3_3 n4_3)
        (connected n4_3 n3_3)
        (connected n3_3 n3_4)
        (connected n3_4 n3_3)
        (connected n3_4 n4_4)
        (connected n4_4 n3_4)
        (connected n4_0 n4_1)
        (connected n4_1 n4_0)
        (connected n4_1 n4_2)
        (connected n4_2 n4_1)
        (connected n4_2 n4_3)
        (connected n4_3 n4_2)
        (connected n4_3 n4_4)
        (connected n4_4 n4_3)
    )

    (:goal (and
        (no_food n4_1)
        (no_food n1_2)
        (no_food n4_0)
    ))
)

; plan
1. (move_pacman n4_1 n3_1)
   added: (at n3_1) (not_at n4_1) (is_visited n3_1)
   goals met: 0 of 3
2. (move_pacman n3_1 n2_1)
   added: (at n2_1) (is_visited n2_1)
   goals met: 0 of 3
3. (move_pacman n2_1 n1_1)
   added: (at n1_1) (is_visited n1_1)
   goals met: 0 of 3
4. (eat_food n1_1 n1_2)
   added: (at n1_2) (no_food n1_2) (is_visited n1_2)
   goals met: 1 of 3
5. (eat_food n4_1 n4_0)
   added: (at n4_0) (no_food n4_0) (is_visited n4_0)
   goals met: 2 of 3
6. (eat_food n3_1 n4_1)
   added: (no_food n4_1) (is_visited n4_1)
   goals met: 3 of 3
